
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
	//++ВКМ Кожевников ВЕ 21.02.2025
	// Вызов процедуры добавления элементов и команд на форму документа ЗаказПокупателя
	ВКМ_ДобавитьРеквизитыФорымы(); 
	
	// Меняет параметры выбора договора
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", 
	                Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);                     
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр); 
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.Договор.ПараметрыВыбора = НовыеПараметры; 
	//--ВКМ Кожевников ВЕ
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

//++ВКМ Кожевников ВЕ 21.02.2025 Добавление на форму Реализации товаров и услуг команды Заполнить 
&НаСервере
Процедура ВКМ_ДобавитьРеквизитыФорымы()
	
	Если Команды.Найти("Заполнить") = Неопределено Тогда
		КомандаЗаполнить = Команды.Добавить("Заполнить");
		КомандаЗаполнить.Заголовок = "Заполнить";
		КомандаЗаполнить.Действие = "ВКМ_Заполнить";
		КомандаЗаполнить.Картинка = БиблиотекаКартинок.ЗаполнитьФорму;
		КомандаЗаполнить.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КонецЕсли;
	
	Если Элементы.Найти("Заполнить") = Неопределено Тогда
		КнопкаЗаполнить = Элементы.Добавить("Заполнить", Тип("КнопкаФормы"), КоманднаяПанель);
		КнопкаЗаполнить.Заголовок = "Заполнить";
		КнопкаЗаполнить.ИмяКоманды = "Заполнить";				
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВКМ_Заполнить(Команда) 
	
	     ВКМ_ЗаполнитьНаСервере();  
		 
КонецПроцедуры  

//Команда Заполнить проверяет вид договора. 
//Если это договор абонентского обслуживания, то вызывает процедуру ВыполнитьАвтозаполнение из модуля объекта документа  

&НаСервере
Процедура ВКМ_ЗаполнитьНаСервере()
	
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ВидДоговора"); 
		
	Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
		ОбъектДокумента = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.РеализацияТоваровУслуг"));
        ОбъектДокумента.ВыполнитьАвтозаполнение();
		ЗначениеВРеквизитФормы(ОбъектДокумента, "Объект");
	КонецЕсли;
	
КонецПроцедуры
//--ВКМ Кожевников ВЕ 21.02.2025

#КонецОбласти

#КонецОбласти
